[
    {
      "id": 0,
      "songName": "Deja vu",
      "artist": "Post Malone and Justin Bieber ",
      "memory": "Us driving together, and the tumultuous nature of the relationship (on again off again)",
      "cause": "The chorus is catchy and it's a great song, but the lyrics represented us very well and it's funny since we listened to it a lot late at night"
    },
    {
      "id": 1,
      "songName": "It never entered my mind",
      "artist": "Miles Davis Quintet",
      "memory": "Sad memories",
      "cause": "The piano intro"
    },
    {
      "id": 2,
      "songName": "Cellophane",
      "artist": "FKA Twigs",
      "memory": "Being replaced ",
      "cause": "Very sad, yearning tone, feels helpless"
    },
    {
      "id": 3,
      "songName": "Strange",
      "artist": "Celeste",
      "memory": "The break up",
      "cause": "breaking up is the theme of the song"
    },
    {
      "id": 4,
      "songName": "Death Cup",
      "artist": "Mom Jeans.",
      "memory": "The person that fits the topic of the song the most, and our relationship we had",
      "cause": "It was her favorite band while we were together"
    },
    {
      "id": 5,
      "songName": "One More Weekend",
      "artist": "Maude Latour",
      "cause": "there's a line that says 'and i got a crush on the shape of your name on my phone'"
    },
    {
      "id": 6,
      "songName": "you broke me first",
      "artist": "Tate McRae",
      "memory": "Reminds me of crying in my friends car screaming this song",
      "cause": "I think its the sadness and how he lowkey cheated on me"
    },
    {
      "id": 7,
      "songName": "Destroy Myself Just For You",
      "artist": "Montell Fish",
      "memory": "crying in my car after a breakup LOL",
      "cause": "the song is about destroying yourself for another person and that is exactly what that relationship did to me."
    },
    {
      "id": 8,
      "songName": "Wish I Knew You",
      "artist": "The Revivalists ",
      "memory": "Beer soaked nights of singing along to this song in particular ",
      "cause": "Good times that have passed and shall never return I.e late nights out with an individual who I likely will never see again "
    },
    {
      "id": 9,
      "songName": "Happier than Ever",
      "artist": "Billie Eilish",
      "memory": "Being sad and expecting someone to change and they don't ",
      "cause": "Being calm in the beginning and then wanting to scream"
    },
    {
      "id": 10,
      "songName": "I wish I had cheated",
      "artist": "Atlus",
      "memory": "Something I could of said",
      "cause": "The lyrics and the beats"
    },
    {
      "id": 11,
      "songName": "Polaroid",
      "artist": "Imagine Dragons",
      "memory": "His favorite song, dancing in my kitchen at midnight after cooking dinner",
      "cause": "I had never heard about it before he showed me. So every time I hear the lyrics I associate it with him. "
    },
    {
      "id": 12,
      "songName": "XO",
      "artist": "Eden",
      "memory": "go fuck yourself",
      "cause": "Basically summarized the whole relationship perfectly"
    },
    {
      "id": 13,
      "songName": "Buttercup",
      "artist": "Hippo Campus",
      "memory": "I kept asking what their favorite song was and they finally showed me this one.",
      "cause": "The start of the song just rings a bell"
    },
    {
      "id": 14,
      "songName": "Comedown",
      "artist": "Josef",
      "memory": "Reminds me of the feelings i felt at the time of heartbreak",
      "cause": "The part where it mentions that both partners are dealing w personal things and love cant always fix each other "
    },
    {
      "id": 15,
      "songName": "Do I Make You Wanna",
      "artist": "Billy Currington",
      "memory": "Face times and crying",
      "cause": "My ex and I made a playlist together while on facetime and that song was his top pick. When I broke up with him the playlist was on in the background and he sobbed."
    },
    {
      "id": 16,
      "songName": "Love Story",
      "artist": "Taylor Swift",
      "memory": "My ex girlfriend seriously loved Taylor Swift and I was made to listen to this song constantly. The main memory is that I got her a record of the album this song is on for her birthday and the first time she played it she made me sit and watch her do a full live performance of the song (and most of the other ones but this one was probably the most intensive)",
      "cause": "We didn't listen to that much music together but this song is so popular that I feel like it just somehow came on all the time when we were together. She also always made the joke that if we ever broke up I would be screwed because every time I heard Taylor Swift I would think of her, which is now true."
    },
    {
      "id": 17,
      "songName": "Glimpse of Us",
      "artist": "Joji",
      "memory": "How happy we used to be when we first started dating",
      "cause": "the beat and lyrics "
    },
    {
      "id": 18,
      "songName": "*Equip Sunglasses*",
      "artist": "Hot Mulligan",
      "memory": "Listening to the song when upset right after a breakup, as well as seeing the song performed live once feeling much better about myself.",
      "cause": "The aggressive lyrics and tone of the chorus."
    },
    {
      "id": 19,
      "songName": "Love, Me Normally",
      "artist": "Will Wood",
      "memory": "Being ghosted and isolated!! I had a period of very unfortunate mental health and I was unable to get any support from my best friend at the time.",
      "cause": "The part about halfway through where he \"talks to the audience\" and criticizes relationships in general as well as (in my opinion) how they force people to conform and hide mental issues."
    },
    {
      "id": 20,
      "songName": "Happy Now",
      "artist": "Pentatonix",
      "memory": "Not knowing how to be happy without them and feeling like nothing was enjoyable anymore",
      "cause": "It's really just the words. The constant questioning of feelings and actions and if it's okay to be feeling that way or doing those things. It almost feels illegal "
    },
    {
      "id": 21,
      "songName": "Relapse",
      "artist": "BoysWorld",
      "memory": "It reminds me of my first serious relationship ",
      "cause": "It reminds me how we kept trying to make the relationship work when it was obvious we needed to break up with eachother "
    },
    {
      "id": 22,
      "songName": "Heartless",
      "artist": "Kanye",
      "memory": "Her friends were always talking smack about me, and she broke it off cause apparently I didn't give her enough attention",
      "cause": "The lyrics"
    },
    {
      "id": 23,
      "songName": "Who hurt you?",
      "artist": "Daniel Caesar",
      "memory": "There isn't one particular memory I think of when this song comes up. I just mainly think of that person and all the memories we had created together. ",
      "cause": "The rhythm and patterns of sounds, if that makes sense. I don't think the lyrics have much to do about breakups, so it's definitely not the lyrics. Also, the person and I both loved Daniel Caesar, and we listened to his music together often, so I think the association of those various memories causes them to surface. "
    },
    {
      "id": 24,
      "songName": "Last Kiss ",
      "artist": "Taylor Swift",
      "memory": "The multiple times he broke up with me and thought that I would never kiss him again ",
      "cause": "The lyrics"
    },
    {
      "id": 25,
      "songName": "Todo Estaba Bien",
      "artist": "Carlos Sadness",
      "memory": "When breaking started happening",
      "cause": "yes"
    },
    {
      "id": 26,
      "songName": "Ball w/o you",
      "artist": "21 Savage",
      "memory": "Feelings of melancholy and sadness as well as nostalgia ",
      "cause": "The lyrics talk about betrayal which is what happened, and the softer overall sound of the song evokes sadder feelings "
    },
    {
      "id": 27,
      "songName": "Sure Thing",
      "artist": "Miguel",
      "memory": "What could have been ",
      "cause": "Lyrics, beat "
    },
    {
      "id": 28,
      "songName": "Partin Ways ",
      "artist": "Polo G ",
      "memory": "It reminds me about the time I broke up with the dummy and hungout with him after n my friend was playing this song n it was pretty ironic n funny but sad. ",
      "cause": "The lyric 'I don't care if it's toxic want your love and I need it now' in the song reminds me of how toxic he can be and causes the memories to resurface lmao. "
    },
    {
      "id": 29,
      "songName": "Sword from the Stone",
      "artist": "Passenger",
      "memory": "The sadness I felt after my breakup",
      "cause": "I didn't have a whole lot of support after my break up, so this song made me feel like someone cared about what I was going through and was looking out for me. "
    },
    {
      "id": 30,
      "songName": "Session 32",
      "artist": "Summer Walker ",
      "memory": "Just memories of good times especially when being in the phone late at night haha ",
      "cause": "When she sings it just hits a core feeling knowing relationships ain't worth saving if it's toxic and letting go!"
    },
    {
      "id": 31,
      "songName": "Ivy",
      "artist": "Frank Ocean",
      "memory": "It was the first time I ever said 'I love you' to someone and my first serious boyfriend. Also we broke up around the time I first found the song so it reminds me of my first true heartbreak.",
      "cause": "I think the slow dreamlike feel of it of being in love for the first time. The first line 'I thought that I was dreaming when you said you loved me' always reminds me of how it felt to feel this romantic love for the first time. "
    },
    {
      "id": 32,
      "songName": "winter snakes ",
      "artist": "Joy Again",
      "memory": "I think about how my ex showed me this song and put it on the first ever playlist they made for me. I remember how I felt the first time I listened to that playlist and that song. I also have a bad association with that particular band and my ex which makes me extra sad!",
      "cause": "its just such a nostalgic song for me and I look back fondly on the times when I first heard it. It's a really really dark and sad song but something about it is sweet and comforting "
    },
    {
      "id": 33,
      "songName": "Farewell Transmission",
      "artist": "Songs: Ohia",
      "memory": "Driving in the car on our way to various outdoor spots (camping, skiing, Rocky Mtn National Park)",
      "cause": "He was the first person to show it to me! And I didn't know anyone else who listened to that artist. "
    },
    {
      "id": 34,
      "songName": "I Love You So",
      "artist": "The Walters",
      "memory": "Me realizing the meaning of the song weeks after he had dumped me - it devastated me even further than I already felt",
      "cause": "He showed me this song and put it in a playlist for our one year anniversary"
    },
    {
      "id": 35,
      "songName": "Silk",
      "artist": "Wolf Alice",
      "memory": "Failure",
      "cause": "\"Choose life\""
    },
    {
      "id": 36,
      "songName": "Ready/Problems",
      "artist": "Boy Pablo",
      "memory": "the situation of why  we broke up and how i felt leading up to the break up",
      "cause": "lyrics"
    },
    {
      "id": 37,
      "songName": "Francis Forever",
      "artist": "Mitski",
      "memory": "Memories of my old best friend who was also probably my first love. Makes me sad. ",
      "cause": "The line \"I look up at the gaps of sunlight I miss you more than anything\""
    },
    {
      "id": 38,
      "songName": "Change ",
      "artist": "Big Theif",
      "memory": "The ending of the relationship when things stopped feeling right.",
      "cause": "The lyrics and the pace "
    },
    {
      "id": 39,
      "songName": "Constant Bullshit",
      "artist": "Summer Walker",
      "memory": "The constant bullshit that I faced towards the end of the relationship.",
      "cause": "Hearing Summer talk about the Constant Bullshit that London would tell her"
    },
    {
      "id": 40,
      "songName": "The End of Heartache",
      "artist": "Killswitch Engage",
      "memory": "The messiness of my cheating, regrets and the possibilities that were foregone ",
      "cause": "the tone and textures evoke a feeling of longing for something that cant exist anymore. And then longing for the end of that painful feeling."
    },
    {
      "id": 41,
      "songName": "Yebba's Heartbreak",
      "artist": "Drake and Yebba",
      "memory": "It brings back memories of me being there for my ex-partner during the tough times of their life. ",
      "cause": "The lyrics directly correlate to how I felt once he broke up with me. I feel bad that his personal troubles were too much for him to handle on top of our relationship. I’ve always saw the best in him and wanted to help him get through those tough times, but even I could not help enough. I wish he knew how capable he was and how much I believed in him even though he did not have the same faith in himself. "
    },
    {
      "id": 42,
      "songName": "Supercut",
      "artist": "Lorde",
      "memory": "It reminds me of my first break up in high school, and feeling like I could only remember the good things about the relationship afterwards.",
      "cause": "The repetition of the line 'In my head' reminds me of in my own head I was for months after the break up"
    },
    {
      "id": 43,
      "songName": "'Coaster' ",
      "artist": "Khalid",
      "memory": "Reminds me our times together and how things didn't work out ",
      "cause": "The vibe and because he dedicated it to me "
    },
    {
      "id": 44,
      "songName": "do re mi",
      "artist": "blackbear",
      "memory": "Listening to this song on repeat with my friend after we had (within a few months of each other) left borderline abusive relationships. The song had come out only shortly before and it resonated with both of us",
      "cause": "The lyrics. It's a breakup song, but he's happy about it, because it needed to be done for his own sanity. This is the feeling you get when you leave a toxic relationships. We both knew it could’ve gotten so much worse but we didn't let it because we had each other to talk sense into us. It also has a club-like beat so it's easy to dance to!"
    },
    {
      "id": 45,
      "songName": "Bottom of A Heartbreak",
      "artist": "NEEDTOBREATHE",
      "memory": "I really related to this song right after I broke up a long term relationship. ",
      "cause": "It's about how a heartbreak is not something you can immediately fix. It's about learning to take it at your own pace and heal in your own time. That time in my life all I could do was reflect and be right where I was. "
    },
    {
      "id": 46,
      "songName": "Skin Tight",
      "artist": "Ravyn Lenae featuring Steve Lacy",
      "memory": "Losing a love that I never wanted to end. I was moving to a different state, and I couldn't do long distance. ",
      "cause": "The song came out during our breakup, and it talks about admitting to your love that the relationship you have together won't go as planned. "
    },
    {
      "id": 47,
      "songName": "Boys Will Be Boys",
      "artist": "Dua Lipa",
      "memory": "I actually haven't broken up before, but have felt two platonic and one romantic heartbreaks. So these songs remind me of the reason for the heartbreak, for Boys Will Be Boys, it's due to me realizing my crush never liked me back, and the fact that it is best to move on.",
      "cause": "It is all in the lyrics. "
    },
    {
      "id": 48,
      "songName": "Mad At Disney",
      "artist": "Salem Ilese",
      "memory": "I actually haven't broken up before, but have felt two platonic and one romantic heartbreaks. So these songs remind me of the reason for the heartbreak, for Boys Will Be Boys, it's due to me realizing my crush never liked me back, and the fact that it is best to move on.",
      "cause": "It is all in the lyrics. "
    },
    {
      "id": 49,
      "songName": "Home",
      "artist": "Susan Egan",
      "memory": "I actually haven't broken up before, but have felt two platonic and one romantic heartbreaks. So these songs remind me of the reason for the heartbreak, for Boys Will Be Boys, it's due to me realizing my crush never liked me back, and the fact that it is best to move on.",
      "cause": "It is all in the lyrics. "
    },
    {
      "id": 50,
      "songName": "Good For You",
      "artist": "Rachel Bay Jones, Kristolyn Lloyd, Will Roland, Ben Platt",
      "memory": "I actually haven't broken up before, but have felt two platonic and one romantic heartbreaks. So these songs remind me of the reason for the heartbreak, for Boys Will Be Boys, it's due to me realizing my crush never liked me back, and the fact that it is best to move on.",
      "cause": "It is all in the lyrics. "
    },
    {
      "id": 51,
      "songName": "Exile ",
      "artist": "Taylor Swift and Bon Iver",
      "memory": "Listening to it with my ex in her apartment. Singing it together with me singing his part and her singing Taylor's. She showed me this song one night when we were sitting on the couch together. I think I was a bit anxious cause it was a divergence from the plan. Now, truthfully, I wish I could loop that moment.",
      "cause": "The piano riff. And the words of the chorus. And the section of the song that goes, 'so step right out, there is no amount of crying I could do for you.' Particularly the run on 'crying.'"
    },
    {
      "id": 52,
      "songName": "Story of My Life",
      "artist": "One Direction",
      "memory": "slow dancing in my childhood home back yard with only the phone speaker being held up to our ears at 11pm at night. being asked, very publicly, to homecoming as the song played over the auditorium sound system. ",
      "cause": "i recognize the beginning of the song immediately. no matter how long it's been, i get a pit in my stomach the second i recognize it."
    },
    {
      "id": 53,
      "songName": "Tether",
      "artist": "CHVRCHES",
      "memory": "The drive home from where we were when she ended it",
      "cause": "The lyrics, specifically, \"Feeling capable of seeing the end. Feeling capable of saying its over\""
    },
    {
      "id": 54,
      "songName": "Anthem",
      "artist": "Greta Van Fleet",
      "memory": "This was our 'song'- we saw them in concert together and we would listen to it a lot together. It reminds me of being super in love with my ex boyfriend. ",
      "cause": "The lyrics and the memories of him. "
    },
    {
      "id": 55,
      "songName": "The night we met",
      "artist": "lord huron",
      "memory": "going back in time to change things",
      "cause": "generally sad, regret"
    },
    {
      "id": 56,
      "songName": "San Luis",
      "artist": "Gregory Alan Isakov",
      "memory": "Driving my ex home after parties, he'd always play this song which was so soft and had such strong contrast with his outgoing crazy personality.",
      "cause": "\"I'm a ghost of you\", he still feels like a part of me"
    },
    {
      "id": 57,
      "songName": "Moon and stars",
      "artist": "$not",
      "memory": "it just reminds me of bad times mostly",
      "cause": "i used to listen to it a lot during the relationship, because it was our song"
    },
    {
      "id": 58,
      "songName": "I Will Survive",
      "artist": "Cake",
      "memory": "Spite",
      "cause": "How much the attitude of the song changes from the original makes it hit a bit harder. I got led on and shit on by this psycho woman and when she had a freak out at me and lost her mind, made me sad for awhile until I realized I was tired of it all anyway."
    },
    {
      "id": 59,
      "songName": "stick season",
      "artist": "noah kahan",
      "memory": "going to vermont with my ex for a ski trip",
      "cause": "it talks about vermont and lyrics are very similar to the way i imagine he felt when i left for school"
    },
    {
      "id": 60,
      "songName": "Norman Fucking Rockwell",
      "artist": "Lana Del Rey",
      "memory": "just reminds me of the guy the lyrics describe",
      "cause": "the lyrics are super literal and i relate to what the lyrics say about the guy the lyrics also quite literally describe our relationship "
    },
    {
      "id": 61,
      "songName": "american girl",
      "artist": "tom petty",
      "memory": "sitting in a a car in high school from the first time we dated, song came on and it lined up w a lot of things between us",
      "cause": "the song"
    },
    {
      "id": 62,
      "songName": "Strip that down",
      "artist": "Liam Payne",
      "memory": "Singing in the car late at night",
      "cause": "It's a silly inside joke and reminds me of the late night memories "
    },
    {
      "id": 63,
      "songName": "You Don't Own Me",
      "artist": "SayGrace FT. GEazy",
      "memory": "It makes me feel free & empowered to do whatever I please.",
      "cause": "« You don't own me » is very liberating"
    },
    {
      "id": 64,
      "songName": "Right down the line ",
      "artist": "Gerry Rafferty",
      "memory": "Reminds me of planning out a future with my last ex. ",
      "cause": "The lyrics related to us and we would listen to it together. "
    },
    {
      "id": 65,
      "songName": "Cross My Mind",
      "artist": "A R I Z O N A",
      "memory": "It reminds me of a time of anxiety and worry.",
      "cause": "The lyrics 'Not a single day when you don't cross my mind'"
    },
    {
      "id": 66,
      "songName": "In a good way",
      "artist": "Faye Webster",
      "memory": "Just being super happy and thinking about this girl that I was talking to. ",
      "cause": "The lyrics, especially when she's talking about wanting to cry in a good way- I've felt that. "
    },
    {
      "id": 67,
      "songName": "Push",
      "artist": "Fog Lake ",
      "memory": "It reminds me of the breakup in general. I listened to it a lot right after we broke up",
      "cause": "The memory of saying goodbye. We had a mutual breakup when I started college. We didn't wanna do long distance. "
    },
    {
      "id": 68,
      "songName": "STATS",
      "artist": "Baby keem",
      "memory": "Driving up to go skiing during the holidays with my ex. ",
      "cause": "We would always listen to that song together so even though the song lyrics specifically dont relate us the situation does. "
    },
    {
      "id": 69,
      "songName": "Keep doing what your doing",
      "artist": "Bryson Tiller",
      "memory": "This song remind of failed relationships, lost friendships, and brings up a lot of self reflection.",
      "cause": "The tone of the song and specifically the second verse. "
    },
    {
      "id": 70,
      "songName": "Alive with the Glory of Love ",
      "artist": "Say Anything ",
      "memory": "He told me that he felt comfortable with me and that this song reminded me of him. Then when I went away to college he send me a picture of this song on his Apple car play in the car. ",
      "cause": "The lyrics "
    },
    {
      "id": 71,
      "songName": "Everything You Want",
      "artist": "Vertical Horizon",
      "memory": "It reminds me of how everytime I was with my ex I always thought of how perfect he was, and yet how I didn't really feel like how I thought I should. ",
      "cause": "Specifically the chorus, \"He's everything you want, he's everything you need, he's everything inside of you that you wish you could be. He says all the right things at exactly the right time, but he means nothing to you and you don't know why.\" This chorus makes me remember how he and I were always a good fit and I looked at him like some prodigy, and that over time I resented that he was better at things that I wish I could do. "
    },
    {
      "id": 72,
      "songName": "Yellow ",
      "artist": "Coldplay ",
      "memory": "The memory of being apart from someone close to me ",
      "cause": "It is their favorite song "
    },
    {
      "id": 73,
      "songName": "1990 was a long year and we are all out of hot water now",
      "artist": "jordaan mason and the horse museum, Jordaan Mason",
      "memory": "The last months of the relationship where things were falling apart and he was growing distant as well as the desperation of trying to talk to him while he either ignores me or simply doesn't respond.",
      "cause": "The lyrics are very explicitly about a divorced couple forced to live together due to a war (the album's concept is very confusing but that doesn't really matter). The song is also incredibly stripped down instrumentally forcing a focus on the lyrics. Jordaan's voice is also very emotive and gets the feeling of the lyrics across even if the listener didn't know the words."
    },
    {
      "id": 74,
      "songName": "abcdefu",
      "artist": "GAYLE",
      "memory": "This song reminds me of how he blew up on me and called me 'a lot to handle' and 'too much' after I was nothing but grateful for everything he did, it just didn't work out, so I dumped him. Something he couldn't handle.",
      "cause": "The artist is giving her ex a nice f-u, which is how I feel about my own (and one to his mom… something I would also like to say to her since she basically called me fat one time).  It was super popular right after the break up, so I heard it a ton when I was healing, and screaming it was a good way to let my emotions out. "
    },
    {
      "id": 75,
      "songName": "Lucy",
      "artist": "Still Woozy",
      "memory": "This song reminds me of the summer time with this guy I was in a relationship with, we were in Golden CO looking out to the continental divide listening to this song during golden hour, and he later told me that it was at a certain point during this song where he looked at me and knew he was falling for me",
      "cause": "The beginning of the song for sure, and also there is a lyric that goes \"Safe is your heart, lover\" and there's something about that line that strikes a chord."
    },
    {
      "id": 76,
      "songName": "'Kevin's Heart' ",
      "artist": "J.Cole",
      "memory": "Sitting in the car with my boyfriend and him singing this song when it first came out. He just looked really good and idk why I just have such a distinct memory of his face and his voice. ",
      "cause": "He was singing the lyrics 'and only have eyes and only have eyes for you' while looking directly into my eyes so every time i hear that song I think about that moment. ITS IRONIC THO because 'Kevin's Heart' is a song LITERALLY ABOUT CHEATING! And somehow it's the most memorable one I have with my boyfriend (he didn't cheat on me btw but) "
    },
    {
      "id": 77,
      "songName": "Here with me",
      "artist": "Marshmello",
      "memory": "I attached this song to my past relationship. It was one of my first relationships in high school where all I wanted was attention but didn't know the difference between good or bad attention. Looking back at that relationship makes me feel gross and this song triggers the same emotions. The specific memory was, I was hanging out at a park with them and I told them that this song reminded me of our relationship (aka this song says I should be dependent on you so I will try to be dependent on you). And I remember the feeling of just wanting their approval of me. ",
      "cause": "I had an unhealthy relationship and this song (in my option) shared a really unhealthy view on relationships which at that time in my life I thought was what I wanted."
    },
    {
      "id": 78,
      "songName": "Eleven",
      "artist": "Rob Curly",
      "memory": "When I was 14, my first boyfriend assaulted me while this song was playing",
      "cause": "The entire thing. Within the first note I know what it is."
    },
    {
      "id": 79,
      "songName": "All to well",
      "artist": "Taylor Swift",
      "memory": "I think about the day we broke up rather than our relationship",
      "cause": "One of the line goes 'maybe this thing was a masterpiece till you tore it all up' and that reminds me of the breakup "
    },
    {
      "id": 80,
      "songName": "Hopin' n' wishin' (A love song for your enemies)",
      "artist": "The Official Bard of Baldwin County",
      "memory": "A toxic relationship",
      "cause": "The song captures the way a toxic relationship brings pain to those involved during and after the relationship"
    },
    {
      "id": 81,
      "songName": "Save me",
      "artist": "Queen",
      "memory": "First hardest breakup from highschool",
      "cause": "The lyrics, the piano, etc"
    },
    {
      "id": 82,
      "songName": "Mean it",
      "artist": "Lauv"
    },
    {
      "id": 83,
      "songName": "Happiness",
      "artist": "Taylor Swift",
      "memory": "it makes me reflect on the relationship, memories and moments of how i was happy because i thought i was, even if later i reflect and i really wasnt. ",
      "cause": "the lyrics"
    },
    {
      "id": 84,
      "songName": "Ease Me ",
      "artist": "Pageant Boys",
      "memory": "I remember listening to this song on my drive home after we broke up, it also reminds me of conversations we had that preceded the eventual breakup. ",
      "cause": "A few of the lyrics make me remember. Specifically, 'sorry's always better than a goodbye, keep feeling like we had this conversation'  "
    },
    {
      "id": 85,
      "songName": "Bruises ",
      "artist": "Lewis Capaldi ",
      "memory": "My high school breakup ",
      "cause": "It was the song I cried to for about a entire month straight "
    },
    {
      "id": 86,
      "songName": "Elise",
      "artist": "the greeting committee ",
      "memory": "my ex dedicating it to me after we broke up. It makes me think about the simple happy memories we did have.",
      "cause": "it talks about how much you can remember and know about someone you’re in love with."
    },
    {
      "id": 87,
      "songName": "Kissing Other People",
      "artist": "Lennon Stella ",
      "memory": "The memories of first moving on ",
      "cause": "The LYRICS. like DAMNN "
    },
    {
      "id": 88,
      "songName": "Ghost boy",
      "artist": "Lil peep",
      "memory": "Living in my parents basement",
      "cause": "Idk just the artist in general"
    },
    {
      "id": 89,
      "songName": "80s Films",
      "artist": "Jon Bellion",
      "memory": "'our song' 🤪🤪🤪",
      "cause": "I feel nostalgic "
    },
    {
      "id": 90,
      "songName": "Hey there Delilah ",
      "artist": "Plain White Ts",
      "memory": "Stupid feelings ",
      "cause": "The fact that they are so in love regardless of anything else "
    },
    {
      "id": 91,
      "songName": "Hurt Less",
      "artist": "Julien Baker",
      "memory": "People (exs and friends) leaving me for a newer shinier cooler option",
      "cause": "It's the song I would use to self loathe in my bedroom so I can't really make a happy connection to it"
    },
    {
      "id": 92,
      "songName": "I Bet You Think About Me (Taylor's Version)",
      "artist": "Taylor Swift and Chris Stapleton",
      "memory": "How I settled for less than I should have. ",
      "cause": "The lyrics and my life-long love of Taylor Swift"
    },
    {
      "id": 93,
      "songName": "Crush",
      "artist": "Tessa Violet",
      "memory": "My ex really liked this song, so it always reminds me of them. Mostly just reminds me of my dislike for them. ",
      "cause": "The song itself just reminds me of them because they really liked it and played it all the time. The artist is heavily associated with them too"
    },
    {
      "id": 94,
      "songName": "Vienna ",
      "artist": "Billy Joel ",
      "memory": "My ex loved this song. ",
      "cause": "I associate this song with her and knowing that she loves it, I just can't do it. Instant skip. I used to love the song too. "
    },
    {
      "id": 95,
      "songName": "Deja Vu ",
      "artist": "Olivia Rodrigo",
      "memory": "What we used to do together for fun ",
      "cause": "He went straight to a new girl after we broke up and the lyrics talk about that "
    },
    {
      "id": 96,
      "songName": "summertime in paris",
      "artist": "jaden smith",
      "memory": "ex😢",
      "cause": "the way it sounds mostly"
    },
    {
      "id": 97,
      "songName": "Kids",
      "artist": "MGMT",
      "memory": "This song reminds me of my lifts/workouts after a break up the summer before I came to college. ",
      "cause": "Reminds me of the feelings I had about growing and working on myself before going to college."
    },
    {
      "id": 98,
      "songName": "Pluto Projector",
      "artist": "Rex Orange County",
      "memory": "I remember my ex, all the good feelings we had, and it reminds me of how special that connection was and how much I miss it, but I try not to even listen to that artist at all anymore.",
      "cause": "The melody is very calm and invites me in, but the lyrics feel very sincere and very similar to how I felt at the time, so it hits a hard soft spot."
    },
    {
      "id": 99,
      "songName": "Yours",
      "artist": "Evann McIntosh",
      "memory": "This song reminds of a time when I was completely in love and devoted to a single person. It makes me remember the vulnerability and trust I had with this person. It reminds me of looking in her eyes in a parked car and dancing in my kitchen. ",
      "cause": "The lyrics. They way it's sang. I can feel the emotions the song is expressing and it reminds me of a time when I felt that way."
    },
    {
      "id": 100,
      "songName": "I want to hold your hand ",
      "artist": "The beatles",
      "memory": "Gross cause my first girlfriend was weird",
      "cause": "Just the chorus"
    },
    {
      "id": 101,
      "songName": "Calling you",
      "artist": "Blue October ",
      "memory": "The last time I was in the car with my ex ",
      "cause": "It was our song "
    },
    {
      "id": 102,
      "songName": "July",
      "artist": "Noah Cyrus",
      "memory": "Freshly broke up",
      "cause": "Opening line and bridge"
    },
    {
      "id": 103,
      "songName": "Somebody Else",
      "artist": "The 1975",
      "memory": "It encompasses the thoughts of not wanting your ex, but realizing you're not really over them, and you don't want to see them with somebody else. ",
      "cause": "The lyrics \"I don't want your body but I hate to think about you with somebody else\""
    },
    {
      "id": 104,
      "songName": "Life is a highway",
      "artist": "Rascall flatts"
    },
    {
      "id": 105,
      "songName": "Fantasy ",
      "artist": "Mariah Carey",
      "memory": "My ex girlfriend showing me the song and telling me she changes the lyrics to 'I’m in heaven with my girlfriend' and I still hear those lyrics",
      "cause": "The fact that the first time I heard it was when my ex showed it to me"
    },
    {
      "id": 106,
      "songName": "Channel Orange in Your Living Room",
      "artist": "Charlie Burg",
      "memory": "My ex and everything about that",
      "cause": "Specific lyrics"
    },
    {
      "id": 107,
      "songName": "Fly me to the Moon",
      "artist": "Frank Sinatra ",
      "memory": "The person",
      "cause": "It was our song to listen too"
    },
    {
      "id": 108,
      "songName": "Location Unknown (ft BEKA)",
      "artist": "Honne and BEKA",
      "memory": "emotional distance. ",
      "cause": "A conversation:( would be nice. "
    },
    {
      "id": 109,
      "songName": "Liability",
      "artist": "Lorde",
      "memory": "Post breakup with an ex",
      "cause": "It's so sad and the lyrics just hit hard "
    },
    {
      "id": 110,
      "songName": "Nothing's Gonna Hurt You Baby",
      "artist": "Cigarettes After Sex",
      "memory": "Listening to the song together while feeling happy and relaxed",
      "cause": "We listened to it together often"
    },
    {
      "id": 111,
      "songName": "Already Gone",
      "artist": "Sleeping at Last",
      "memory": "Breaking up with a girl while also losing my best friend on the same day, crying under my bed because my two closest people were gone in one day",
      "cause": "A video of me crying to it"
    },
    {
      "id": 112,
      "songName": "Dust in the Wind",
      "artist": "Kansas ",
      "memory": "Learning on guitar with him",
      "cause": "The guitar instrumental at the beginning"
    },
    {
      "id": 113,
      "songName": "Hell",
      "artist": "Clown Core",
      "memory": "When we talked about how good of a drummer the band had and how it was so meme but so good",
      "cause": "The drummer and the random saxophone solo"
    },
    {
      "id": 114,
      "songName": "Stick Talk",
      "artist": "Future",
      "memory": "First date/ time out and many other times",
      "cause": "The lyrics convinced me to do some interesting things with this person "
    },
    {
      "id": 115,
      "songName": "Like You Do ",
      "artist": "Joji",
      "memory": "How much this person cared for me and would do for me before another person started getting that same attention ",
      "cause": "the lyrics get to me the most"
    },
    {
      "id": 116,
      "songName": "A Sad Song About a Girl I No Longer Know",
      "artist": "Bedside Kites",
      "memory": "Listened to it constantly after the breakup. It was my first breakup and relationship so i felt like I was dying. Every single lyric resonated",
      "cause": "The lyrics obviously and the background guitar. Also the raspiness of his voice"
    },
    {
      "id": 117,
      "songName": "All Too Well (10 Minute Version) (Taylor's Version)",
      "artist": "Taylor Swift",
      "memory": "Betrayal, Crying in bed",
      "cause": "the fact that it's 10 minutes - feel overwhelmed with how long it goes"
    },
    {
      "id": 118,
      "songName": "In Case You Don't Live Forever",
      "artist": "Ben Platt",
      "memory": "It brings up memories of how the break up happened and how I felt during that time. I felt terrified, unstable, confused, anxious, panicked, and overall I was just in a really bad place as this break up was happening. The break up was messy. We were in a very unstable place, and we’d broken up once before. Then we talked and realized we had miscommunicated and misunderstood each other because of that. Then we tried again, but I was trying to rebuild while he was still deciding what he wanted as well as talking to another girl while telling me he had feelings for me. This song reminds me of how I was led on on top of the mental and emotional hardships I was going through, and the betrayal I felt by someone I’d been vulnerable to.",
      "cause": "He showed me this song as a way to tell me he loved me. That I was meaningful and he cared about me. The song is sweet, and it just feels sickly sweet. It feels fake. It just reminds me of the betrayal and hurt of being led on. 'I love you' but he didn't."
    },
    {
      "id": 119,
      "songName": "Can't Wait",
      "artist": "Chon",
      "memory": "Very deep depression and extreme loss",
      "cause": "I performed this song at a music festival in highschool and it was pretty much the last interaction I had with this girl that was positive"
    },
    {
      "id": 120,
      "songName": "Devotion ",
      "artist": "Rufus du sol ",
      "memory": "Searching the east coast for waves and surfing all day then getting out of the water after seeing a gorgeous sunset to get warm under a blanket with her",
      "cause": "'Drive up the coast line stop by the shore to stare at the ocean. wait for a calling a call from the ocean to lead me away lead me away lead me away. I’ll fly over the mountains into the night sky on the horizon or dive into the ocean wherever you go I will follow you there waves crash on the shoreline kissing the sand the sign of devotion, stay stay in the moment surrender your heart and leave me away leave me away'"
    },
    {
      "id": 121,
      "songName": "I Still Ain't Over You",
      "artist": "Augustana",
      "memory": "It brings up memories of my post-breakup and the difficult emotions I felt afterwards. Listening to this song while biking or driving and processing the emotions. ",
      "cause": "It's a fairly upbeat song, but I listened to this a lot after a breakup because while he wanted to part ways, I didn't want to. It resonates with me because it took a long time for me to move on and I kept waiting to see if it would take as long as one year and fourteen months to get over the relationship (which is the length of time the song mentions). "
    },
    {
      "id": 122,
      "songName": "Reckoner",
      "artist": "Radiohead",
      "memory": "feeling numb in my bed",
      "cause": "the vocals "
    },
    {
      "id": 123,
      "songName": "The Moment I Knew",
      "artist": "Taylor Swift",
      "memory": "Memories of me needing more and they didn't seem willing to give it ",
      "cause": "Taylor's Version of Red came out a month and a half after I went through a break up "
    },
    {
      "id": 124,
      "songName": "Famous Last Words",
      "artist": "My Chemical Romance",
      "memory": "After the fact of the breakup(s), as it has remained as my main song for moving on with my life. It isn't about missing the other person but acknowledges how awful it can be. The main memory I have is singing it in general as a singer to direct my exes.",
      "cause": "\"I am not afraid to keep on living, I am not afraid to walk this world alone\" is a very powerful lyric. That and the belting backing vocals at the end just have a particular pain to them."
    },
    {
      "id": 125,
      "songName": "If Only",
      "artist": "Queens of the Stone Age",
      "memory": "Breaking down at 2am sitting outside shortly after our breakup, but I like this song a lot and don't relate it as much now. ",
      "cause": "I listened to it on loop for multiple hours after our breakup"
    },
    {
      "id": 126,
      "songName": "All the Way Down",
      "artist": "Glen Hansard",
      "memory": "Pretty much every time my ex would call me a liar or crazy. The biggest instance would be when I asked if he was seeing someone (he was) and he started calling me delusional and crazy and putting all the guilt on me.",
      "cause": "I think mainly the sad tone and the lyric 'you have broken me all the way down' really puts me in the mindset of how I would feel. Even though the song is slightly positive as it's about leaving a broken relationship, I only really think about the painful portions of the song (and the painful portions of my relationship). Especially the lyric 'when you’ve missed every shot for me' reminds me of how the relationship felt unequal since, in my eyes, I would be the one to put in any effort while never having reciprocation. This song is also from a movie musical that I’ve asked my ex to watch with me and he refused so that's also partially why I associate those memories with it."
    },
    {
      "id": 127,
      "songName": "Crash Into Me",
      "artist": "Dave Matthews Band",
      "memory": "Dancing in the dark",
      "cause": "That was her favorite song"
    },
    {
      "id": 128,
      "songName": "Goodie bag",
      "artist": "Still woozie ",
      "memory": "Freshman year gf just the time ",
      "cause": "Melody and intro"
    },
    {
      "id": 129,
      "songName": "Naked ",
      "artist": "James Arthur",
      "memory": "Feeling weak",
      "cause": "The intensity of his voice and the lyrics "
    },
    {
      "id": 130,
      "songName": "If We Were Vampires ",
      "artist": "Jason Isbelle and the 400 Unit ",
      "memory": "Driving to Steamboat with my ex ",
      "cause": "That memory was the first time I listened to it "
    },
    {
      "id": 131,
      "songName": "Wish You Were Here",
      "artist": "Pink Floyd",
      "memory": "Just missing my ex, and just like yearning for what was even if it turned bad ",
      "cause": "The lyrics and the amazing guitar "
    },
    {
      "id": 132,
      "songName": "Start Again",
      "artist": "Sub Sound",
      "memory": "Me reminiscing about the good times with her",
      "cause": "Nothing"
    },
    {
      "id": 133,
      "songName": "Because of You ",
      "artist": "Kelly Clarksom",
      "memory": "I would say the memories are very negative, a lot of fear",
      "cause": "the lyrics "
    },
    {
      "id": 134,
      "songName": "Hannah Hunt",
      "artist": "Vampire Weekend",
      "memory": "Just being in a hopeless situation and knowing that you can do nothing to change it.",
      "cause": "I think because it's so melancholic but like the bridge shows the desperation and anguish."
    },
    {
      "id": 135,
      "songName": "Road to The Faire",
      "artist": "David Arkenstone",
      "memory": "Starting a fresh chapter",
      "cause": "Listened to it on severe repeat during my breakup."
    },
    {
      "id": 136,
      "songName": "Solo Dolo",
      "artist": "Kid Cudi",
      "memory": "Rejection and the fact you only have yourself",
      "cause": "The balance of self employment and loneliness"
    },
    {
      "id": 137,
      "songName": "Music sounds better with you",
      "artist": "Neil Frances",
      "memory": "My ex made a video of us together on our first trip to the mountians it was my favorite song. It was our song. ",
      "cause": "I made myself think music did sound better with her so these lyrics kinda make me angry"
    },
    {
      "id": 138,
      "songName": "Young and Beautiful ",
      "artist": "Lana Del Rey",
      "memory": "A guy that kinda sucks but he showed me Lana Del Rey and she's sick.",
      "cause": "That he showed it to me."
    },
    {
      "id": 139,
      "songName": "Jocelyn flores",
      "artist": "xxxtentacion",
      "memory": "it's a nice song to cry to",
      "cause": "his voice "
    },
    {
      "id": 140,
      "songName": "Tequila",
      "artist": "Dan and Shay",
      "memory": "Listening to it in the car ",
      "cause": "Sky high in Colorado - I went to college in Colorado. We drank Tequila at a concert together "
    },
    {
      "id": 141,
      "songName": "Lovers rock",
      "artist": "Tv girl",
      "memory": "Happy ones that are now depressing ",
      "cause": "Listened to the song with them a lot"
    },
    {
      "id": 142,
      "songName": "Fade into You",
      "artist": "Mazzy Star",
      "memory": "memories with my ex who was literally emotionally manipulative",
      "cause": "just hearing it in general "
    },
    {
      "id": 143,
      "songName": "Shots",
      "artist": "LMFAO",
      "memory": "helping me get over a break up",
      "cause": "the screaming shots "
    },
    {
      "id": 144,
      "songName": "Tim McGraw",
      "artist": "Taylor Swift ",
      "memory": "Makes me think of person and both the good times and the bad ",
      "cause": "The lyric's perfectly describe my situation and my feelings "
    },
    {
      "id": 145,
      "songName": "Mystery of love",
      "artist": "Sufjan stevens ",
      "memory": "The heartbreaking feeling of not knowing why you’re not chosen  ",
      "cause": "It's connected to a movie about a breakup which made me want to listen to it when I experienced something similar "
    },
    {
      "id": 146,
      "songName": "Night Shift",
      "artist": "Lucy Dacus",
      "memory": "thats just the first one but I just feel like sobbing when I hear these songs and the fact that I want to hide form him and never see him again because hes not who he used to be ",
      "cause": "\"you've got a 9 to 5 so I'll take the night shift, and I'll never see you again if I can help it\" "
    },
    {
      "id": 147,
      "songName": "Not over you",
      "artist": "Gavin DeGraw",
      "memory": "It just reminds me how I messed up and will probably never get over my ex until the day I die ",
      "cause": "' I would lie and say that you’re not in my mind, but I go out and sit down at a table set for two and finally I’m forced to face the truth. No matter what I say I’m not over you' - everything reminds me of him "
    },
    {
      "id": 148,
      "songName": "Best friend ",
      "artist": "Rex oc",
      "memory": "My ex was my best friend ",
      "cause": "Sadness"
    },
    {
      "id": 149,
      "songName": "Lessons",
      "artist": "Stormzy ",
      "memory": "Break up"
    },
    {
      "id": 150,
      "songName": "Nothing/Sad N Stuff",
      "artist": "Lizzie Mcalphine ",
      "memory": "crying in my room",
      "cause": "how i felt in the relationship "
    },
    {
      "id": 151,
      "songName": "Whiskey Lullaby ",
      "artist": "Alison Krauss, Brad Paisley",
      "memory": "Car rides with my ex-boyfriend, overlooks, holding each other's hands and being together period, not having to say anything, just being in the presence of each other.",
      "cause": "Some of the country aspects, but the lyrics and tempo specifically; I recall singing the lyrics together with my ex-boyfriend."
    },
    {
      "id": 152,
      "songName": "All I want",
      "artist": "Kodaline",
      "memory": "makes me think about driving in my car after a long day",
      "cause": "the lyrics speak to me because it's about something/someone unattainable that I want for myself "
    },
    {
      "id": 153,
      "songName": "You belong with me ",
      "artist": "Taylor Swift ",
      "memory": "All the girls be would typically date and how I would compare myself to them and stalk is following ",
      "cause": "Just how she is so different from what he thought was ideal and how I knew I was better than his type "
    },
    {
      "id": 154,
      "songName": "Hit Eject",
      "artist": "The Garden",
      "memory": "Just memories of the relationship with the girl I think was my first actual love",
      "cause": "She played it all the time when we were together and I hated the band for a long time but now I enjoy the song and being able to reminisce "
    },
    {
      "id": 155,
      "songName": "Gemini",
      "artist": "Nightflight Orchestra",
      "memory": "Listening to it in his car",
      "cause": "He introduce me to the band and right before we broke up we were listening to it a lot"
    },
    {
      "id": 156,
      "songName": "Death by a thousand cuts",
      "artist": "Taylor Swift",
      "memory": "Getting broken up with even though both partners are still in love and haven't given up on the relationship.",
      "cause": "The lyrics and analogy of the breakup being a house and that even though the house is 'boarded up' there is still life inside as the 'chandeliers are still flickering here' that represents there still being love in the relationship. "
    },
    {
      "id": 157,
      "songName": "Destroy myself just for you",
      "artist": "Montell fish",
      "memory": "My ex boyfriend I WANT TO GET BACK TOGETHER WITH HIM NOWWWWWW BUT HE DOESNT WANT TO",
      "cause": "We used to listen to this artist together "
    },
    {
      "id": 158,
      "songName": "moonlight on the river",
      "artist": "mac demarco",
      "memory": "i’d rather not comment",
      "cause": "i’d rather not comment "
    },
    {
      "id": 159,
      "songName": "i still say goodnight",
      "artist": "tate mcrae",
      "memory": "me ex stopped saying goodnight and started drifting away, and then he cheated ",
      "cause": "song about break up and what the boy did to the girl"
    },
    {
      "id": 160,
      "songName": "Since I’ve Been Loving You",
      "artist": "Led Zeppelin",
      "memory": "This song makes me remember the times of me and my ex playing this song together with me on guitar and her on vocals",
      "cause": "Just the fact that we played the song together a lot and it reminds me of those good times"
    },
    {
      "id": 161,
      "songName": "Jar of hearts",
      "artist": "Cristiana perri",
      "memory": "We used to sing it for our exes cause we hated them and when we broke up I used to sing this song to him ",
      "cause": "The lyrics hit hard "
    },
    {
      "id": 162,
      "songName": "Sparks",
      "artist": "Coldplay",
      "memory": "This song's lyrics remind me of an almost relationship that I had and how I still will always care about this person. It's a classic case of right person wrong time. ",
      "cause": "First off, it's a really good song. I would listen to it in the car and all the time when I was thinking about this person and how everything went wrong; how I missed my chance with the person I will always love."
    },
    {
      "id": 163,
      "songName": "Somehow. ",
      "artist": "Phony Ppl ",
      "memory": "My ex boyfriend would sing this to me in the car or play it when he knew I was sad. It helped me remember how much he loved me and how long he loved me for. ",
      "cause": "I broke up with my first boyfriend two weeks ago. He liked me for over four years and sent me this over a year before we actually started dating."
    },
    {
      "id": 164,
      "songName": "Before He Cheats ",
      "artist": "Carrie Underwood ",
      "memory": "I loved this song before the breakup and when it happened I changed the lyrics to match the story and it really just gave me something to laugh about. ",
      "cause": "Oh yes definitely "
    },
    {
      "id": 165,
      "songName": "You ",
      "artist": "The 1975",
      "memory": "The weeks following being broken up by my first girlfriend ",
      "cause": "I don't know I just remember discovering this song weeks after it happened because I’ll I was listening to was sad music "
    },
    {
      "id": 166,
      "songName": "dayDREAM",
      "artist": "Collin Selman",
      "memory": "It reminds me of when we first started dating and everything just felt perfect",
      "cause": "I listened to it a lot at the beginning of our relationship"
    },
    {
      "id": 167,
      "songName": "Mikey and the frogs",
      "artist": "Hotel ugly",
      "memory": "My ex showed me this song and we would always listen to it together. it used to make me really sad after we broke up but that was my most recent relationship like 2 years ago now i just have memories that don't necessarily make me happy or sad",
      "cause": "the instruments and melody i think. its hard to say"
    },
    {
      "id": 168,
      "songName": "Compass",
      "artist": "The Neighborhood",
      "memory": "Buried memories of my long distance relationship with the love of my life. I love him dearly we broke up for given circumstances. But we’re still talking again. We actually started talking again just about 3 months ago. ",
      "cause": "The lyrics of the song, the singers voice, it makes me feel like I’m falling in love with my ex all over again. It makes me feel nostalgia, delusion, sadness, in love, everything at once while reminiscing the memories I have with the only person I think I’ll always be in love with even tho we broke up and he's far away from me."
    },
    {
      "id": 169,
      "songName": "Dreams",
      "artist": "Fleetwood Mac",
      "memory": "The song that I vividly remember playing when the guy who I thought I saw myself dating dropped me off at the airport when I moved to Europe. ",
      "cause": "It just makes me think about what could have been if I didn't move. I came back a year later too and he had a girlfriend. "
    },
    {
      "id": 170,
      "songName": "Thank me later",
      "artist": "KINGS",
      "memory": "My ex cheated on me and kept trying to come back and then would go back to the other girl when I wouldn't let him and it was a cycle",
      "cause": "Probably the lyrics or the anger in the song"
    },
    {
      "id": 171,
      "songName": "Kiss Me More",
      "artist": "Doja Cat ft. SZA",
      "memory": "This was the first song that made me happy after I was dumped",
      "cause": "It's upbeat"
    }
]